In [1]:
import pandas as pd

In [2]:
arr=["Kinywarwanda", "Data Structure"]

In [3]:
serie=pd.Series(arr)

In [4]:
type(serie)

pandas.core.series.Series

In [5]:
serie

0      Kinywarwanda
1    Data Structure
dtype: object

In [6]:
arr[-1]

'Data Structure'

#### Create a random 2d dimensions

In [7]:
import numpy as np

In [8]:
arr=np.random.randint(10,100, size=(5,5))

In [9]:
arr

array([[12, 51, 18, 47, 24],
       [75, 14, 64, 84, 91],
       [91, 28, 62, 96, 14],
       [49, 92, 12, 25, 84],
       [23, 49, 49, 28, 51]])

In [10]:
df=pd.DataFrame(arr)

In [11]:
df.columns=["One","Two","Three","Four","Five"]

In [12]:
df["Two"]

0    51
1    14
2    28
3    92
4    49
Name: Two, dtype: int32

In [13]:
df.head(1)

   One  Two  Three  Four  Five
0   12   51     18    47    24

In [14]:
df.tail(3)

   One  Two  Three  Four  Five
2   91   28     62    96    14
3   49   92     12    25    84
4   23   49     49    28    51

In [15]:
df["One"]

0    12
1    75
2    91
3    49
4    23
Name: One, dtype: int32

In [16]:
cols=["One","Two"]

In [17]:
df[["One","Three"]]

   One  Three
0   12     18
1   75     64
2   91     62
3   49     12
4   23     49

In [18]:
df

   One  Two  Three  Four  Five
0   12   51     18    47    24
1   75   14     64    84    91
2   91   28     62    96    14
3   49   92     12    25    84
4   23   49     49    28    51

In [19]:
df["Four & Five"]=df["Four"]+df["Five"]

In [20]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [21]:
df.iloc[2:4]

   One  Two  Three  Four  Five  Four & Five
2   91   28     62    96    14          110
3   49   92     12    25    84          109

In [22]:
df.iloc[3]

One             49
Two             92
Three           12
Four            25
Five            84
Four & Five    109
Name: 3, dtype: int32

In [23]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [24]:
df.iloc[2:4,1:5]

   Two  Three  Four  Five
2   28     62    96    14
3   92     12    25    84

In [25]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [26]:
mask=df %2 == 0

In [27]:
df[mask]

    One   Two  Three  Four  Five  Four & Five
0  12.0   NaN   18.0   NaN  24.0          NaN
1   NaN  14.0   64.0  84.0   NaN          NaN
2   NaN  28.0   62.0  96.0  14.0        110.0
3   NaN  92.0   12.0   NaN  84.0          NaN
4   NaN   NaN    NaN  28.0   NaN          NaN

In [28]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [29]:
df['One']

0    12
1    75
2    91
3    49
4    23
Name: One, dtype: int32

In [30]:
df[mask]

    One   Two  Three  Four  Five  Four & Five
0  12.0   NaN   18.0   NaN  24.0          NaN
1   NaN  14.0   64.0  84.0   NaN          NaN
2   NaN  28.0   62.0  96.0  14.0        110.0
3   NaN  92.0   12.0   NaN  84.0          NaN
4   NaN   NaN    NaN  28.0   NaN          NaN

In [31]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [32]:
df[ df["One"] %2==0 ]

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71

In [33]:
df[:1]

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71

In [34]:
df[df["Two"]==32][["Four", "Five"]]

Empty DataFrame
Columns: [Four, Five]
Index: []

In [35]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [36]:
mask=(df["One"]>30) & (df["Five"]>90)

In [37]:
df[mask][["Two","Four & Five"]][0:4]

   Two  Four & Five
1   14          175

In [38]:
dfNump=df.values

In [39]:
dfNump

array([[ 12,  51,  18,  47,  24,  71],
       [ 75,  14,  64,  84,  91, 175],
       [ 91,  28,  62,  96,  14, 110],
       [ 49,  92,  12,  25,  84, 109],
       [ 23,  49,  49,  28,  51,  79]])

In [40]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [41]:
df.dtypes

One            int32
Two            int32
Three          int32
Four           int32
Five           int32
Four & Five    int32
dtype: object

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   One          5 non-null      int32
 1   Two          5 non-null      int32
 2   Three        5 non-null      int32
 3   Four         5 non-null      int32
 4   Five         5 non-null      int32
 5   Four & Five  5 non-null      int32
dtypes: int32(6)
memory usage: 248.0 bytes

In [43]:
df.describe()["mean":"min"]

            One        Two      Three       Four       Five  Four & Five
mean  50.000000  46.800000  41.000000  56.000000  52.800000   108.800000
std   33.466401  29.558417  24.515301  32.442256  34.535489    40.929207
min   12.000000  14.000000  12.000000  25.000000  14.000000    71.000000

In [44]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [45]:
df.describe()

             One        Two      Three       Four       Five  Four & Five
count   5.000000   5.000000   5.000000   5.000000   5.000000     5.000000
mean   50.000000  46.800000  41.000000  56.000000  52.800000   108.800000
std    33.466401  29.558417  24.515301  32.442256  34.535489    40.929207
min    12.000000  14.000000  12.000000  25.000000  14.000000    71.000000
25%    23.000000  28.000000  18.000000  28.000000  24.000000    79.000000
50%    49.000000  49.000000  49.000000  47.000000  51.000000   109.000000
75%    75.000000  51.000000  62.000000  84.000000  84.000000   110.000000
max    91.000000  92.000000  64.000000  96.000000  91.000000   175.000000

In [46]:
df.describe().iloc[3:6, 1:]

      Two  Three  Four  Five  Four & Five
min  14.0   12.0  25.0  14.0         71.0
25%  28.0   18.0  28.0  24.0         79.0
50%  49.0   49.0  47.0  51.0        109.0

In [47]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [48]:
df[df["Four & Five"]==130]

Empty DataFrame
Columns: [One, Two, Three, Four, Five, Four & Five]
Index: []

In [49]:
df["Four & Five"]==130

0    False
1    False
2    False
3    False
4    False
Name: Four & Five, dtype: bool

In [50]:
df[df["Four & Five"]==130].shape

(0, 6)

In [53]:
df

   One  Two  Three  Four  Five  Four & Five
0   12   51     18    47    24           71
1   75   14     64    84    91          175
2   91   28     62    96    14          110
3   49   92     12    25    84          109
4   23   49     49    28    51           79

In [57]:
df[df["One"]<15]["Three"]

0    18
Name: Three, dtype: int32